VanessaVsLsfusion/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.РасчетныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчеты</name>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DefinedType.РасчетныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VanessaVsLsfusion/src/AccumulationRegisters/РасчетыСКонтрагентами/РасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокумент</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

VanessaVsLsfusion/src/Enums/ТипыДетализацииРасчетов/ТипыДетализацииРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДетализацииРасчетов</name>
  <enumValues>
    <name>ПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>ПоРасчетнымДокументам</name>
  </enumValues>
</mdclass:Enum>

VanessaVsLsfusion/src/Documents/ПоступлениеНаРасчетныйСчет/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	УстановитьВидимостьТабличнойЧастиРасчеты();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	ПредложитьПересчитатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	КлиентСервер.ПересчитатьШапкуДокументаПриИзмененииСуммы(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	КлиентСервер.ПересчитатьШапкуДокументаПриИзмененииСтавкиНДС(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСПриИзменении(Элемент)
	
	КлиентСервер.ПересчитатьШапкуДокументаПриИзмененииНДС(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьПересчитатьСумму()
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПредложитьПересчитатьСуммуЗавершение", ЭтотОбъект), "Пересчитать сумму?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьПересчитатьСуммуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСумму();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСумму()
	
	КлиентСервер.ПересчитатьШапкуДокументаПриИзмененииСуммаВключаетНДС(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьТабличнойЧастиРасчеты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТабличнойЧастиРасчеты()
	
	Если Объект.Договор.ДетализацияРасчетов = Перечисления.ТипыДетализацииРасчетов.ПоРасчетнымДокументам Тогда
		Элементы.Расчеты.Видимость = Истина;
	Иначе
		Элементы.Расчеты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасчеты(Команда)
	
	ЗаполнитьРасчетыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчетыНаСервере()
	
	Объект.Расчеты.Очистить();
	
	ОставшаясяСумма = Объект.СуммаСНДС;
	
	Если ОставшаясяСумма <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И Договор = &Договор) КАК РасчетыСКонтрагентамиОстатки
	|ГДЕ
	|	РасчетыСКонтрагентамиОстатки.СуммаОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетыСКонтрагентамиОстатки.РасчетныйДокумент.Дата,
	|	РасчетыСКонтрагентамиОстатки.РасчетныйДокумент.Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", Сервер.ПолучитьГраницуИсключаяДокумент(Объект));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		СтрокаТабличнойЧасти = Объект.Расчеты.Добавить();
		СтрокаТабличнойЧасти.РасчетныйДокумент = ВыборкаЗапроса.РасчетныйДокумент;
		
		Если ВыборкаЗапроса.Сумма > ОставшаясяСумма Тогда
			
			СтрокаТабличнойЧасти.Сумма = ВыборкаЗапроса.Сумма;
			
			ОставшаясяСумма = ОставшаясяСумма - ВыборкаЗапроса.Сумма;
			
		Иначе
			
			СтрокаТабличнойЧасти.Сумма = ОставшаясяСумма;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
